# -*- mode: org; -*-
#+TITLE: ob-agent-shell tests
#+STARTUP: showall

* Setup

Evaluate this block first to load the package:

#+begin_src emacs-lisp
(add-to-list 'load-path (expand-file-name "~/dev/ob-agent-shell"))
(load (expand-file-name "~/dev/ob-agent-shell/ob-agent-shell.el"))
(add-to-list 'org-babel-load-languages '(agent-shell . t))
(org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
#+end_src

#+RESULTS:

* Test 1 — basic response

#+begin_src agent-shell
Reply with exactly: hello from agent-shell
#+end_src

#+RESULTS:
: hello from agent-shell

* Test 2 — multiline response

#+begin_src agent-shell
List three fruits, one per line, no preamble.
#+end_src

#+RESULTS:
: Apple
: Banana
: Cherry

* Test 3 — specify buffer explicitly

Replace MY-AGENT-SHELL-BUFFER with the actual name of your agent-shell buffer
(check with M-x list-buffers if unsure).

#+begin_src agent-shell :buffer **
Reply with exactly: buffer targeting works
#+end_src

* Test 4 — timeout (set very short to trigger it)

#+begin_src emacs-lisp
(setq ob-agent-shell-timeout 2)
#+end_src

#+RESULTS:
: 2

#+begin_src agent-shell
Reply with exactly: this should time out if timeout is 2s and agent is slow
#+end_src

#+begin_src emacs-lisp
;; Reset timeout to default
(setq ob-agent-shell-timeout 120)
#+end_src
